# Created by N.Kazakov ver 1.00

# python imports
import sys
import re
from xml.dom import minidom


def main(*args):
    root = {Файл: {ВерсФорм: "1.00", ВерсПрог: "convert", ИдФайл: "ON_NSCHFDOPPR_"}}
    branchs = {
        СвУчДокОбор: {ИдПол: "", ИдОтпр: ""},
    Документ: {Функция: "СЧФ", НаимЭконСубСост: "", ДатаИнфПр: "", ВремИнфПр: "00.00.00", КНД: "1115131"},
        СвСчФакт: {КодОКВ: "", ДатаСчФ: "", НомерСчФ: "",},
        СведТов: {
            СтТовУчНал: "", НалСт: "", СтТовБезНДС: "", ЦенаТов: "", КолТов: "", ОКЕИ_Тов: "", НаимТов: "", НомСтр: ""},
        ВсегоОпл: {СтТовУчНалВсего: "", СтТовБезНДСВсего: ""},
        ЮЛ: {ИННЮЛ: "", Должн: ""}}
    node = {
        СвПрод: None,
        СвПокуп: None,
        ИдСв: None,
        Адрес: None,
        ТаблСчФакт: None,
        Акциз: None,
        СумНал: None,
        СумНалВсего: None,
        Подписант: None}
    leafs = {СвОЭДОтпр: {ИдЭДО: "", ИННЮЛ: "", НаимОрг: "Наименование ЮЛ Оператора"},
        СвЮЛПрод: {Name:"СвЮЛУч", ИННЮЛ: "", НаимОрг: "", КПП: ""},
        АдрИнфПрод: {Name:"АдрИнф", АдрТекст: "", КодСтр: ""},
        СвЮЛПокуп: {Name:"СвЮЛУч", ИННЮЛ: "", НаимОрг: "", КПП: ""},
        АдрИнфПокуп: {Name:"АдрИнф", АдрТекст: "", КодСтр: ""},
        ДопСведТов: {НаимЕдИзм: ""},
        ФИО: {Отчество: "", Имя: "", Фамилия: ""}}
    data = {БезАкциз: "", СумНал: 0}

    headDocument = [
        "Счет-фактура", "Продавец", "Адрес", "ИНН/КПП продавца", "Покупатель", "Адрес", "ИНН/КПП покупателя", "Валюта"]
    bodyDocument = [
        "Наименование товара", "код", "условное обозначение", "Коли-чество", "Цена", "без налога - всего", "сумма акциза",
        "Налоговая ставка", "Сумма налога", "с налогом - всего"]
    cellsDocument = ["B", "F", "I", "K", "M", "O", "R", "S", "V", "X"]

        # get the doc from the scripting context.which is made available to all scripts
    desktop = XSCRIPTCONTEXT.getDesktop()
    model = desktop.getCurrentComponent()
    sheets = model.Sheets
    sheet = sheets[0]
    for i in range(14):
        pass
    for i in [*bodyDocument]:
        pass

    return None
